# TileMortarColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Tile..::..TileMortarColor Property
Tile Class See Also
---
The property labeled "Grout Color" from the "Tile" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TileMortarColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TileMortarColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ TileMortarColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
Tile Class
Autodesk.Revit.DB.Visual Namespace